УТ_для_edt/src/InformationRegisters/CRM_ЗапланированныеАктивности/CRM_ЗапланированныеАктивности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЗапланированныеАктивности</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАктивности</name>
    <type>
      <types>EnumRef.CRM_ТипыАктивности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланируемаяАктивность</name>
    <type>
      <types>DocumentRef.CRM_Взаимодействие</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ОтборыЗавершаемыхАктивностей/CRM_ОтборыЗавершаемыхАктивностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ОтборыЗавершаемыхАктивностей</name>
  <enumValues>
    <name>ВсеЗапланированные</name>
  </enumValues>
  <enumValues>
    <name>ПерваяЗапланированная</name>
  </enumValues>
  <enumValues>
    <name>ПросроченныеИНаСегодня</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_СостоянияСобытий/CRM_СостоянияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияСобытий</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Запланировано</name>
      <description>Запланировано</description>
    </items>
    <items>
      <name>Отменено</name>
      <description>Отменено</description>
    </items>
  </predefined>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСостояния</name>
    <type>
      <types>EnumRef.CRM_ТипыСостоянийСобытий</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/CRM_ЗапланированныеАктивности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция - Следующая запланированная активность
//  Функция возвращает информацию о следующем взаимодействии или задаче выбранного интереса.
//
// Параметры:
//  Объект			- Ссылка, ДокументСсылка.CRM_Интерес			- Ссылка на интерес, 
//					по которому проверяются следующие запланированные активности.
//  ТипАктивности	- Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности - Ссылка на тип активности, 
//					задача или взаимодействие.
// 
// Возвращаемое значение:
//  Результат		- Структура значений реквизитов записи регистра.
//  	ПланируемаяАктивность	- Ссылка,ДокументСсылка.CRM_Взаимодействие, ЗадачаСсылка.ЗадачаИсполнителя
//  	Ответственный	- Ссылка,СправочникСсылка.РолиИсполнителей, СправочникСсылка.Пользователи
//  	Тема			- Строка
//  	ПланируемаяДата	- Дата
//  	ТипАктивности	- ПеречислениеСсылка.CRM_ТипыАктивности
//
Функция СледующаяЗапланированнаяАктивность(Объект, ТипАктивности = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность,
	                      |	CRM_ЗапланированныеАктивности.Ответственный КАК Ответственный,
	                      |	CRM_ЗапланированныеАктивности.Тема КАК Тема,
	                      |	CRM_ЗапланированныеАктивности.ТипАктивности КАК ТипАктивности,
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяДата КАК ПланируемаяДата
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПланируемаяДата");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("ПланируемаяАктивность, Ответственный, Тема, ПланируемаяДата, ТипАктивности");
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВидФормы = "ФормаЗаписи" Тогда
		СтандартнаяОбработка = Ложь;
		Параметры.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Параметры.Вставить("ТолькоПросмотр", Ложь);
		Если ТипЗнч(Параметры.Ключ) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			Если CRM_Взаимодействия.ВзаимодействиеЗавершеноИлиОтменено(Параметры.Ключ) Тогда
				Параметры.Вставить("ОткрыватьФорму", Истина);
				ВыбраннаяФорма = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента";
			Иначе
				ВыбраннаяФорма = "Документ.CRM_Взаимодействие.Форма.ФормаДокументаКраткая";
			КонецЕсли;
		ИначеЕсли ТипЗнч(Параметры.Ключ) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
			Параметры.Вставить("ИзСпискаАктивностей", Истина);
			CRM_МетодыМодулейМенеджеровЗадач.ОбработкаПолученияФормОбъектовCRM(Задачи.ЗадачаИсполнителя, "ФормаОбъекта", Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Есть активности к завершению
//
// Параметры:
//  Объект			 - Ссылка, ДокументСсылка.CRM_Интерес							 - Ссылка на интерес,
//  							по которому проверяются наличие активности к завершению.
//  ТипАктивности	 - Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности				 - Ссылка на тип активности,
//  				задача или взаимодействие.
//  ОтборЗавершаемых - Ссылка, ПеречислениеСсылка.CRM_ОтборыЗавершаемыхАктивностей	 - Ссылка на тип отбора по регистру.
// 
// Возвращаемое значение:
//  Булево - Признак наличия задач или взаимодействия готовых к завершению.
//
Функция ЕстьАктивностиКЗавершению(Объект, ТипАктивности = Неопределено, ОтборЗавершаемых) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату
	                      |	И ВЫБОР
	                      |			КОГДА CRM_ЗапланированныеАктивности.ПланируемаяАктивность ССЫЛКА Задача.ЗадачаИсполнителя
	                      |				ТОГДА CRM_ЗапланированныеАктивности.ПланируемаяАктивность.CRM_Личная
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяДата");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПросроченныеИНаСегодня Тогда
		ЗавершатьПоДату = КонецДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЗавершатьПоДату", ЗавершатьПоДату);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату", "");
	КонецЕсли;
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Процедура - Завершить активности
//  Процедура переводит задачу или взаимодействие в статус "Завершено".
//
// Параметры:
//  Объект			 - Ссылка, ДокументСсылка.CRM_Интерес							 - Ссылка на интерес, который необходимо завершить.
//  Результат		 - Строка														 - Описание результата выполнения процедуры.
//  ТипАктивности	 - Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности				 - Ссылка на тип активности, задача или взаимодействие.
//  ОтборЗавершаемых - Ссылка, ПеречислениеСсылка.CRM_ОтборыЗавершаемыхАктивностей	 - Ссылка на тип отбора по регистру.
//
Процедура ЗавершитьАктивности(Объект, Результат = "", ТипАктивности = Неопределено, ОтборЗавершаемых) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяДата");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПросроченныеИНаСегодня Тогда
		ЗавершатьПоДату = КонецДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЗавершатьПоДату", ЗавершатьПоДату);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Завершено;
			ПланируемаяАктивность.Результат = ?(ЗначениеЗаполнено(Результат), Результат, НСтр("ru='Завершено автоматически';en='Completed Automatically'"));
			ПланируемаяАктивность.ДатаЗавершенияВзаимодействия = ТекущаяДатаСеанса();
			ПланируемаяАктивность.Записать();
		ИначеЕсли ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") И Выборка.ПланируемаяАктивность.CRM_Личная Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.Выполнена = Истина;
			ПланируемаяАктивность.РезультатВыполнения = ?(ЗначениеЗаполнено(Результат), Результат, НСтр("ru='Завершена автоматически';en='Finished automatically'"));
			ПланируемаяАктивность.Записать();
		КонецЕсли;
		Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПерваяЗапланированная Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Процедура - Отменить активности
//
// Параметры:
//  Объект			 - Ссылка, ДокументСсылка.CRM_Интерес							 - Ссылка на интерес,
//  																				   по которому отменяются активности.
//  Результат		 - Строка														 - Результат выполнения процедуры
//  ТипАктивности	 - Ссылка, ПеречислениеСсылка.CRM_ТипыАктивности				 - Ссылка на тип активности,
//  																				   задача или взаимодействие.
//  ОтборЗавершаемых - Ссылка, ПеречислениеСсылка.CRM_ОтборыЗавершаемыхАктивностей	 - Ссылка на тип отбора по регистру.
//
Процедура ОтменитьАктивности(Объект, Результат, ТипАктивности = Неопределено, ОтборЗавершаемых = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ЗапланированныеАктивности.ПланируемаяАктивность КАК ПланируемаяАктивность
	                      |ИЗ
	                      |	РегистрСведений.CRM_ЗапланированныеАктивности КАК CRM_ЗапланированныеАктивности
	                      |ГДЕ
	                      |	CRM_ЗапланированныеАктивности.Объект = &Объект
	                      |	И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности
	                      |	И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Если ЗначениеЗаполнено(ТипАктивности) Тогда
		Запрос.УстановитьПараметр("ТипАктивности", ТипАктивности);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ТипАктивности = &ТипАктивности", "");
	КонецЕсли;
	Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПросроченныеИНаСегодня Тогда
		ЗавершатьПоДату = КонецДня(ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЗавершатьПоДату", ЗавершатьПоДату);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И CRM_ЗапланированныеАктивности.ПланируемаяДата <= &ЗавершатьПоДату", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ДокументСсылка.CRM_Взаимодействие") Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.СтатусВзаимодействия = Справочники.CRM_СостоянияСобытий.Отменено;
			ПланируемаяАктивность.Результат = Результат;
			ПланируемаяАктивность.Записать();
		ИначеЕсли ТипЗнч(Выборка.ПланируемаяАктивность) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") И Выборка.ПланируемаяАктивность.CRM_Личная Тогда
			ПланируемаяАктивность = Выборка.ПланируемаяАктивность.ПолучитьОбъект();
			ПланируемаяАктивность.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		Если ОтборЗавершаемых = Перечисления.CRM_ОтборыЗавершаемыхАктивностей.ПерваяЗапланированная Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
